# parameters
nc: 1  # number of classes
ni: 3 # input images (aka number of backbones)
ch: 3 # input channels
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
fusion_type: late # early or late

anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

fuse_steps: [4, 6, 9]

fuse: [
  [0, 1, Trans, [256, 64]],  # 0
  [1, 1, Trans, [512, 32]],  # 0
  [2, 1, Trans, [1024, 16]],  # 0
]

# YOLOv5 backbone
# [from, number, module, args]
backbone: [
  [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
  [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
  [-1, 3, C3, [128]],
  [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
  [-1, 6, C3, [256]],
  [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
  [-1, 9, C3, [512]],
  [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
  [-1, 3, C3, [1024]],
  [-1, 1, SPPF, [1024, 5]], # 9
]

# fuse1 -> 0, fuse2 -> 1, fuse3 -> 2, fuse4 -> 3, ...
head: [
  [2, 1, Conv, [512, 1, 1]], # 3 F3
  [-1, 1, nn.Upsample, [None, 2, "nearest"]],
  [[-1, 1], 1, Concat, [1]], # 5 F2
  [-1, 3, C3, [512, False]],

  [-1, 1, Conv, [256, 1, 1]], # 7
  [-1, 1, nn.Upsample, [None, 2, "nearest"]],
  [[-1, 0], 1, Concat, [1]], # F1
  [-1, 3, C3, [256, False]],

  [-1, 1, Conv, [256, 3, 2]], # 11
  [[-1, 7], 1, Concat, [1]],
  [-1, 3, C3, [512, False]], 

  [-1, 1, Conv, [512, 3, 2]], # 14
  [[-1, 3], 1, Concat, [1]],
  [-1, 3, C3, [1024, False]],  # 16

  [[10, 13, 16], 1, Detect, [nc, anchors]]
]
